# Напишите программу, определяющую площадь круга и длину окружности по заданному радиусу R
from math import sqrt, ceil, pi 
R=float(input())
S=pi*pow(R, 2)
C=2*pi*R
print(S)
print(C)

#  На вход поступает число сумируйте пол и потолок для этого числа  
'''from math import ceil,  floor
a=float(input())
ca=ceil(a)
fa=floor(a)
print(ca+fa)
'''







