# На вход программе подаётся одно число n Напишите программу, которая выводит список 
a=int(input())
print(list(range(1, a+1)))



